frodo_ring/frodo_ring_en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-05 Mon 18:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Frodo and the Defective Ring</title>
<meta name="author" content="emporas" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Frodo and the Defective Ring</h1>
<div id="table-of-contents" role="doc-toc">
<h1><a accesskey="H" href="../index.html"> HOME </a></h1><h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org04e189a">Bridge crossing</a></li>
<li><a href="#org5af7aaa">Sam&rsquo;s house</a></li>
<li><a href="#orgcac35df">Mordor company</a></li>
<li><a href="#org785873f">Sauron Mordor&rsquo;s CEO</a></li>
<li><a href="#org977dd9a">Gandalf and the horse</a></li>
<li><a href="#org394f471">Riding to Mordor</a></li>
<li><a href="#org1cd7f5a">Recharging station</a></li>
<li><a href="#org3b4e58d">Toroidal Spider</a></li>
<li><a href="#org08644ef">Spider&rsquo;s advice</a></li>
</ul>
</div>
</div>
<div id="outline-container-org04e189a" class="outline-2">
<h2 id="org04e189a">Bridge crossing</h2>
<div class="outline-text-2" id="text-org04e189a">
<p>
The trees, those bent sinews of bark shuffled in my vision, roots scrabbling the soil, trunks lean inward as a gargoyle’s grin, their crooked boughs knuckling the earth in a mockery of salute. Up ahead, the Shire, that smug green pigbelly, gurgles with mirth I didn’t believe.
</p>

<p>
I, Frodo Baggins, the bearer of the… oh, never mind!
</p>

<p>
I lumbered through the path, into a narrow tunnel of thorns, their canes curled bristling like some ancient hedgehog’s uncombed mustache clucked it&rsquo;s barbed spines. Their spikes gnawed at my ankles, one splinter clutched at my coat and a button popped like a firecracker.
</p>

<p>
The mud squirms underfoot, each step birthing a new wrinkle of filth. My goat soles, once proud, now caked in mud the hue of a rancid lemon drop, dragged me down in protestations as if the very earth conspired to bill me by the step. I kick the moss sludge, and the muck now slithers and squeaks like two disgraced orators.
</p>

<p>
Dense as a wet barmaid’s apron, the fog rolls in. Not the Shire’s usual damp haze but a wet, fleshy thing that clings to my neck and it whispers in the dead tones of a drowned church organist. One tree had limped into the fog, its leaves now fluttering like a thousand fraying tongues.
</p>

<p>
A toad perched on a upturned stone birdbath, squawked with the authority of a prophet, mocking my thirst. Its throat a glistening pink balloon, voice a croak that pulsed, “Rain Rain!” I blinked. By the stars, had that bird been there two heartbeats ago? I swear not.
</p>

<p>
The path ahead splits, but both clefts lead to the same structure. Birthed from the fog, a bridge of knotted entrails, spanning a chasm where the earth yawned like a glutton’s maw. Both identical. Both snarled in rotting leaves. I chose left or right? The decision was made by my foot.
</p>

<p>
The bridge&rsquo;s sinewy ropes groaning as if some ancient beast had been summoned, just to die here for our benefit. Each movement squelched. The knots beneath my feet creaked, the kind of sounds echoing through motel walls at 3 AM, when the bedsprings sing their rusty hymns.
</p>

<p>
Halfway across, I stepped onto one more plank, or what passed as a plank, a single bone from an animal, which may or may not have been wise to butcher. The bone gave, it cracked and my left foot sank in up to the ankle. The abyss clutched at my calf with the enthusiasm of a grandmother who just learned her grandchild’s coming for dinner.
</p>

<p>
A moth, probably drunk on fermented nectar, collided with my forehead. I swatted it&rsquo;s aerial acrobatics, it&rsquo;s wings screaming “Ewt! Ewt!” in a voice that could only belong to a disgruntled elf.
</p>

<p>
I patted my coat. Into my pocket, fingers probing, I found a dragon’s tooth, cold, jagged, and a single button, the one that popped earlier. The tooth lodged stuck in the flap of the pocket. It had to be the one I swindled from a barkeep in Bree for a bottle of rum, no doubt.
</p>

<p>
I tried to pull it out. Stubborn thing! It resisted, caught on fabric, testing my patience. I drew it slow, slow, slow, like a sword. Finally, the tooth emerged, yellow and wicked.
</p>

<p>
The rope binding my ankle, thick as a serpent. I positioned the tooth&rsquo;s edge against the hemp&rsquo;s coarse weave, those fibers twisted together in their presumption of strength, and I sawed. Back and forth, the tooth grinding, chewing, splitting strand by strand.
</p>

<p>
At last the rope parted. The bridge sagged a bit. The abyss below stared at me with patience, knowing that gravity never forgets an appointment.
</p>

<p>
My foot yanked free, sucked from the bone gap. I stumbled forward, caught myself on the bridge&rsquo;s remaining ropes, those sinews still clinging to their purpose.
</p>

<p>
The rope I cut, it hung loose now, dangling like a finger wagging in disapproval.
</p>

<p>
Up ahead, the fog began to peel away in thin, shivering layers, revealing the far shore: a patch of ground flat as a sheet of parchment and ground green like a witch&rsquo;s sneer.
</p>

<p>
What words could better fit to a fog after all, if not for a democracy of shadows?
</p>

<p>
Behind me, the bridge snapped midair as though it had grown tired of being a bridge and, in a final act of rebellion, folded into a paper airplane and launched itself into the chasm’s gaping throat. Rocks gnashed their gums at the falling debris.
</p>

<p>
I stood on the far shore, still attached to my limbs, still fully clothed, save the missing button.
</p>

<p>
A nest of crows perched ahead, took notice of the bridge collapsing, and the whole flock erupted. Their beaks opened in unison, croaking not a death omen but an imitating, xylophonic trill of the bridge atomizing itself into a mosaic of twigs and bones.
</p>

<p>
Their wings screeched and they launched themselves into the air, hovered there a moment and dived into the yawning black trachea, which now gargled the remains with the relish of a cannibal’s stew.
</p>

<p>
The ground here, seemed to hum quiet. The fog had cleared entirely. The air was clean. The light was too bright.
</p>
</div>
</div>
