frodo_ring/frodo_ring_en.html
<div id="outline-container-org5af7aaa" class="outline-2">
<h2 id="org5af7aaa">Sam&rsquo;s house</h2>
<div class="outline-text-2" id="text-org5af7aaa">
<p>
I approached the hobbit village of Glimmerroot clung to the hillside. Houses, humps of earth they were, swollen bellies pregnant with pipe smoke, their doors circular, wood split and beetled. Windows like eyes gouged, and the spines of chimneys bent at the neck, strangled by their own smoke.
</p>

<p>
The path towards Sam&rsquo;s house twists in cursive, as though the ground itself is scribbling spells. Stone steps have been worn smooth by decades of hobbit feet, each a different height as if the mason had been drunk, fired, then rehired out of pity.
</p>

<p>
&ldquo;Sam!&rdquo; I called, my voice fracturing against the walls. No answer. His door had iron metal for a handle, rusted the color of dried blood. I gripped the handle. It burned my palm, cold as a widow&rsquo;s hand in a handshake of death. I pushed the door open, it shrieked its hinges.
</p>

<p>
From below, from somewhere beneath the floorboards, came a sound. “The cellar. Where the good stuff grows” I muttered to myself.
</p>

<p>
I descended the staircase, a corkscrew drilled into the earth&rsquo;s bowels, spiraled downward, each step narrower than the last.
</p>

<p>
Barrels lined the walls, stacked three high, their wood bloated with whatever liquids they imprisoned.
</p>

<p>
Sam was there. The floor, packed dirt, had been colonized by a colony of mushrooms, their caps fanning out in all directions, their stalks snaking across the ground, in patterns that suggested either great intelligence or great madness.
</p>

<p>
“Frodo! Frodo Baggins, you half rotted leek!” Sam’s voice boomed.
</p>

<p>
&ldquo;Blimey!&rdquo; he croaked, while ascending, the stairs creaking in a key that only cats could hear.
</p>

<p>
We emerged from the darkness and moved to the table, that ancient slab of wood that dominated the main room like an altar. Sam shuffled to his kitchen area, shelf upon shelf of jars, each containing liquids or solids in various stages. He selected one jar, amber liquid inside, stuff that moved when it shouldn&rsquo;t have moved.
</p>

<p>
“This,” Sam said, leaning forward with the intensity of a man who’d just discovered that mushrooms could be both fuel and fuel for prophecy, “is mushroom tea". His beard, bristled with sporangiophores, spitting spores like tiny parachutists into the void.
</p>

<p>
He poured. The liquid sludged from jar to cup, thick as honey, steam rose, not steam, smoke carrying with it an odor that was part earth, part death, part something else entirely, something that made my nose hairs curl in self defense.
</p>

<p>
Sam pushed the cup across the table toward me. It slid through a layer of dust, leaving a slimy trail behind it.
</p>

<p>
&ldquo;It enhances lingual acuacy,&rdquo; I said, sipping from the cup.
</p>

<p>
&ldquo;That word doesn&rsquo;t exist,&rdquo; he answered, his tea sloshing around.
</p>

<p>
“It exists, in a language I made up right now” I said, “but it may as well belong to the Thrombolic dialect, a language spoken by the fishmen of the Under Salt Sea.”
</p>


<p>
“My ring is malfunctioning lately, Sam,” I said, snatching the ring between thumb and forefinger as if it were a live coal. “For the last three days, it’s made me vanish into the wallpaper while I’m trying to eat breakfast. Think about it, toast and jam, half eaten, and poof, I’m not there. My parsnips were stranded in the air, asking questions about where their master fled.” I knocked the ring on the table. “For a year I wore the ring like a second skin. But now, it’s capricious. Yesterday, it let me be seen by a crow Sam! A bloody corvid that stole my hat!”
</p>

<p>
Sam picked up the ring, squinting at it the way a butcher examines questionable meat. Turned it over. Held it to the candlelight. The flame bent around it.
</p>

<p>
“Frodo,” he said, “this thing o’ yours, it&rsquo;s electronic, innit? Got circuits. Microthaumatology. Probably runs on tiny demons imprisoned in silicon. Those demons get lazy, the whole system crashes. Got wires and gizmos you don’t even know about?”
</p>

<p>
“Do I look like an engineer? What do I know about techno gobble whoop magic?” I snapped, slapping the ring onto the table. It rolled like a drunk beetle. “It’s not a toaster, Sam. It’s a doohickey from Mordor. You ever heard o’ Mordor? They make bespoke magic for folks who want to vanish.”
</p>

<p>
He leaned in, his breath sour with mushroom tea. “Mordor? As in, The Mordor? Black magic manufacturing?”
</p>

<p>
“As in the only company that sells stuff to people who won’t ask questions,” I said. The advertisement promised &rsquo;Invisibility Guaranteed&rsquo;.&ldquo; I picked up the ring, held it to the candle light. &rdquo;The salesman had excellent teeth. Very convincing teeth."
</p>

<p>
&ldquo;Maybe you should phone them. Maybe that gremlin of yours is just low on firmware. Ring up the company. Tell them your ring&rsquo;s defective, that it&rsquo;s making your vanishment asymmetrical.&rdquo;
</p>
</div>
</div>
