frodo_ring/frodo_ring_en.html
<div id="outline-container-orgcac35df" class="outline-2">
<h2 id="orgcac35df">Mordor company</h2>
<div class="outline-text-2" id="text-orgcac35df">
<p>
The telephone, rotary beast it was, squatted on Sam&rsquo;s table, a black bakelite, it&rsquo;s cord kinked intestinal, the receiver heavy as a club meant for skulls.
</p>

<p>
Dialed. Each number a commitment, my finger jamming the rotary holes, the mechanism churning its guts, each rotation a small eternity, clickety clickety click, a mechanical digestive process, the wheel dragging back with the resistance of a reluctant executioner.
</p>

<p>
Ring. Ring. Ring.
</p>

<p>
“Welcome to Mordor Customer Support, where your darkness is our business” a woman representative slithered from the other end. Smooth as arsenic in honey. “My name is Lurgathra, account number, please.”
</p>

<p>
I cleared my throat, spit caught there like a lodger refusing eviction. &ldquo;Account seven seven three dash B dash nine. Frodo Baggins, purchaser of one invisibility ring, model Wraithmaker 3000, serial number..&rdquo;
</p>

<p>
&ldquo;I have your file, Mr. Baggins.&rdquo; Papers shuffled on her end, crisp violent sounds, like bones snapping in a efficient manner. &ldquo;How may I darken your day?&rdquo;
</p>

<p>
&ldquo;My ring doesn&rsquo;t function as it should and it&rsquo;s gotten worse,&rdquo; I answered her, voice dropping to a hiss whispered. "Yesterday morning, mid-disappearance, I got stuck halfway. Top half invisible, gone, vacated the premises, bottom half plain as porridge. My legs stayed behind. They walked to the stove. They brewed tea. They were bored. My torso holidayed to the metaphysical realm, while my ankles stirred the pot!”
</p>

<p>
Silence. Then a throat clearing, professional cough.
</p>

<p>
&ldquo;Mr. Baggins, let me place you on hold for one moment..&rdquo;
</p>

<p>
&ldquo;Wait, no..&rdquo;
</p>

<p>
Music assaulted my ear canal. Not music, really. Elevator melodies composed on what sounded like a accordion made from cat intestines, violins strangled mid-note, harps weeping for mercy.
</p>

<p>
I pressed the receiver harder against my skull. Behind the music, voices. Her voice, muffled now, hand cupped over the mouthpiece some muffled voices leaked through. A chorus of Orcish wails nad her voice, distant but audible, address someone:
</p>

<p>
&ldquo;Grishnákh! GRISHNÁKH! The new Orc, the one from Batch Seven, its face got stuck on the bottom of the cauldron, yes, the bottom, don&rsquo;t you see this one is even uglier than the rest. What do you mean &lsquo;which one?&rsquo; The one that&rsquo;s screaming! Yes, that one. No, we can&rsquo;t sell it like that. I don&rsquo;t care if someone might want a floor faced Orc, decompose it to amino acids and start fresh. Use the big vat. The industrial vat. And for the love of the Dark Lord, stir it this time, don&rsquo;t just dump it in and hope.&rdquo; A wet, meaty splorch. &ldquo;Ah yes. Young Ogg here’s having a difficulty.&rdquo; Metallic clattering. Another squish. &ldquo;There. All better. Shhh. Good boy.&rdquo;
</p>

<p>
I waited. Sam watched, sipping his mushroom tea.
</p>

<p>
The music cut. Her voice returned, smooth once more.
</p>

<p>
&ldquo;Thank you for holding, Mr. Baggins. I apologize for the delay. We&rsquo;re experiencing higher call volumes than usual, and also our manufacturing floor is experiencing what we call an &lsquo;product restructuring moment.&rsquo;&rdquo;
</p>

<p>
&ldquo;About my ring..&rdquo; I started.
</p>

<p>
&ldquo;Yes. Your bisected visibility issue. I&rsquo;ve pulled your ring&rsquo;s data. Model Wraithmaker 3000, purchased eighteen months ago, warranty expired..&rdquo;
</p>

<p>
&ldquo;Expired? I paid good coin for the extended warranty! The salesman with the excellent teeth, he promised..&rdquo;
</p>

<p>
&ldquo;Mr. Baggins.&rdquo; Her voice sharpened, knife drawn from velvet sheath. &ldquo;The extended warranty covers catastrophic failure, not performance degradation. What you&rsquo;re experiencing is classified as &lsquo;irregular phasing,&rsquo; which falls under normal wear and tear.&rdquo;
</p>

<p>
&ldquo;Normal?&rdquo; I bellowed, Sam jumping at the table&rsquo;s far end, his mushroom tea sloshing.
</p>

<p>
&ldquo;Sir, please lower your voice. I understand your frustration. However, the execution environment logs of the ring are not available to the user. The internal workings of your ring, the diagnostic cascade, the thaumaturgic stack trace, all belong to Mordor Industries. This is a security feature to prevent reverse engineering of our proprietary invisibility algorithms.&rdquo;
</p>

<p>
I squeezed the receiver, knuckles whitening, imagining it was her neck, no, no, not her neck, the salesman&rsquo;s neck, those excellent teeth chattering as I throttled him. &ldquo;Security feature? I can&rsquo;t even see what&rsquo;s wrong with my own ring?&rdquo;
</p>

<p>
&ldquo;Correct. The logs are encrypted seventeen times, using demonic ciphers that would liquefy your brain if you attempted to read them. This is for your protection, Mr. Baggins.&rdquo;
</p>

<p>
&ldquo;My protection.&rdquo; I laughed, sound scraping up my throat like gravel through a drainpipe. &ldquo;I&rsquo;m half invisible on a Tuesday morning, startling the milkman into cardiac arrest, and you&rsquo;re protecting me?&rdquo;
</p>

<p>
&ldquo;Sir, I can schedule a diagnostic appointment. Our next available slot is..&rdquo; papers shuffling again, that bone snap sound, &ldquo;..six weeks from now, Tuesday afternoon, between the hours of two and six. Someone will arrive to examine your ring. There is a service fee of forty gold pieces, non refundable, payable in advance.&rdquo;
</p>

<p>
&ldquo;Six weeks? Forty gold pieces?&rdquo;
</p>

<p>
&ldquo;Alternatively,&rdquo; she continued, voice smooth as a confession extracted under duress, &ldquo;you could purchase our new model, the Wraithmaker 4000. It features improved phasing stability, reduced spectral bleed through, and a complimentary curse removal for the first month.&rdquo;
</p>

<p>
&ldquo;You want me to BUY ANOTHER RING?&rdquo;
</p>

<p>
&ldquo;The Wraithmaker 3000 is a legacy product, Mr. Baggins. We no longer manufacture replacement parts. At a certain point, upgrading becomes more cost effective than repair.&rdquo;
</p>
</div>
</div>
