frodo_ring/frodo_ring_en.html
<div id="outline-container-org785873f" class="outline-2">
<h2 id="org785873f">Sauron Mordor&rsquo;s CEO</h2>
<div class="outline-text-2" id="text-org785873f">
<p>
&ldquo;Forward me,&rdquo; I growled into the receiver. &ldquo;To your supervisor. Now. This instant.&rdquo;
</p>

<p>
Silence, pregnant with the weight of a thousand bureaucratic sins.
</p>

<p>
&ldquo;Mr. Baggins..&rdquo;
</p>

<p>
&ldquo;Forward. Me.&rdquo;
</p>

<p>
A sigh leaked through the phone line, wind escaping a corpse&rsquo;s last deflation. &ldquo;One moment please.&rdquo;
</p>

<p>
&ldquo;This is Sauron. CEO, Mordor Industries.&rdquo;
</p>

<p>
&ldquo;Sauron. The Sauron? Eye of flame, forger of..&rdquo;
</p>

<p>
&ldquo;Yes yes yes, all very cinematic, my branding team outdid themselves that fiscal quarter, bonuses for everyone, champagne fountains et cetera et cetera.&rdquo; His voice rolled like boulders down a mountain. &ldquo;Now. Your ring. The Wraithmaker 3000. Serial number etched in the fires of Mount Doom, cooled in the blood of betrayed smiths. What&rsquo;s malfunctioning?&rdquo;
</p>

<p>
&ldquo;Yesterday my legs brewed tea while my torso explored the astral plane. The day before, I sneezed and my head vanished but my body stayed, walking into walls like a decapitated chicken, crashing into furniture, terrifying the neighbors.&rdquo; I stammered.
</p>

<p>
&ldquo;Mmm.&rdquo; A rumble, volcanic, continental shelf deciding whether to split. &ldquo;Classic firmware decay. The demons powering your ring&rsquo;s core processor, tiny bastards they are, have been slacking. Happens. Your case is not unique. We have clients who vanish in threes. Clients who wake up upside down, or inside out, or just flat like pancakes. Unfortunate but inevitable.&rdquo;
</p>

<p>
&ldquo;Inevitable?&rdquo; I shrieked, Sam&rsquo;s teacup rattling against saucer, mushrooms on the cellar floor below probably cowering. &ldquo;Inevitable? I paid good gold for this ring! The salesman, those teeth of his, he promised..&rdquo;
</p>

<p>
&ldquo;Salesmen promise many things, Mr. Baggins.&rdquo; Sauron&rsquo;s voice oozed through the phone line, honey laced with ground glass. &ldquo;They promise eternity. They promise perfection. They promise, buy once, have magic forever, which, let&rsquo;s be honest, in your case was probably the primary selling point, wasn&rsquo;t it?&rdquo;
</p>

<p>
&ldquo;But I&rsquo;m asking: How am I supposed to fix it, if I can&rsquo;t see how it works, if I can&rsquo;t diagnose my own jewelry.&rdquo; I bellowed, receiver pressed so hard against my skull I&rsquo;d probably have circular bruise tomorrow. &ldquo;If the guts of this thing belong to Mordor industries, then who owns it? Me? Or you?&rdquo;
</p>

<p>
Sauron&rsquo;s laugh erupted, not mirth but conquest, a sound reminding me of armies marching through burning villages, of ravens feasting on battlefield corpses, of victory flags planted in the skulls of the defeated. &ldquo;Do you own it, Frodo Baggins? Or do you merely possess it?&rdquo;
</p>

<p>
&ldquo;That&rsquo;s, that&rsquo;s the same thing!&rdquo;
</p>

<p>
&ldquo;You purchased the ring, yes?&rdquo; Sauron wheezed, &ldquo;You misunderstand the nature of ownership in the modern age. You purchased the ring, yes? Gold exchanged hands, contract signed, perhaps in blood, perhaps in ink, the accountants don&rsquo;t specify. You own the physical object, the metal band warping the dimensional stability of your trousers. That&rsquo;s yours.&rdquo;
</p>

<p>
&ldquo;Licensed,&rdquo; I repeated.
</p>

<p>
&ldquo;But!&rdquo; The word detonated through the phone line, shrapnel of syllables, Sam ducked like incoming artillery. &ldquo;The software. The invisibility protocols. The demonic architecture that powers your vanishment—that, Mr. Baggins, you have licensed. Indefinitely, yes, for the duration of your natural life and slightly beyond, but licensed nonetheless. You own the ring. We own the magic inside it.&rdquo;
</p>

<p>
&ldquo;And these logs, the diagnostic cascade, the thaumaturgic stack trace? You, Frodo Baggins, hobbit civilian, wants to peer into the guts of proprietary technology millennia developed? Technology that cost billions in research, in sacrifice literal, in blood spilled measured by the ocean?&rdquo;
</p>

<p>
&ldquo;The ring remains yours, Mr. Baggins. The invisibility, however, that we merely lend. Indefinitely, yes, perpetually even, but lend. You have a license. Irrevocable, non transferable, binding until death and then some. Should you violate the terms of service, reverse engineer the spells, share the incantations, attempt to jailbreak the curse, we reserve the right to remotely deactivate your licensed features. You&rsquo;d be left with a very expensive, very useless circle of metal.&rdquo;
</p>

<p>
&ldquo;Is that legal?&rdquo;
</p>

<p>
&ldquo;Perfectly legal,&rdquo; Sauron purred, cat satisfied after canary consumption. &ldquo;Clause seventeen, subsection B, paragraph nine. &lsquo;User acknowledges that invisibility functionality constitutes licensed intellectual property and remains property sole of Mordor Industries in perpetuity plus seventy years, whichever comes last.&rsquo; You signed this, Mr. Baggins. Your signature sits in our vault, preserved in amber, guarded by Balrogs.&rdquo;
</p>

<p>
&ldquo;Should you violate the terms of service, reverse engineer the spells, share the incantations, attempt to jailbreak the curse, post the source code on public forums for other malcontents, we reserve the right, Mr. Baggins, to remotely deactivate your licensed features.&rdquo;
</p>

<p>
&ldquo;You can turn it off?&rdquo;
</p>

<p>
&ldquo;With a thought. With a memo. With a checkbox on a form processed by our Legal Department, Third Floor, West Wing, Carol handles those, lovely woman, makes excellent scones for the office parties. One checkbox, Mr. Baggins, and your ring becomes jewelry. Fashionable, perhaps. Shiny, certainly. Functional?&rdquo; He paused, letting the word hang like a noose. &ldquo;No.&rdquo;
</p>

<p>
&ldquo;Do we have an understanding, Mr. Baggins?&rdquo;
</p>

<p>
I nodded, realized he couldn&rsquo;t see, croaked, &ldquo;Yes.&rdquo;
</p>

<p>
&ldquo;Wonderful. Thank you for choosing Mordor Industries, where your darkness is our business. Have a day.&rdquo;
</p>

<p>
Click.
</p>

<p>
The line went dead.
</p>

<p>
&ldquo;Frodo,&rdquo; Sam said softly, &ldquo;I think you need more mushroom tea.&rdquo;
</p>

<p>
I nodded. Words had abandoned me. Logic had fled screaming.
</p>

<p>
In a tower of black stone and spreadsheets, Sauron returned to his paperwork, another soul bound not by curses but by contracts, far more permanent, far more cruel.
</p>

<p>
The receiver sat heavy in my hand. Through the window, a crow landed, cocked its head, judging me with eyes that&rsquo;d seen this conversation play out a thousand times before, in a thousand different houses, with a thousand different suckers clutching telephones and realizing too late they&rsquo;d been sold snake oil by a man with beautiful teeth. So beautiful teeth!
</p>
</div>
</div>
