frodo_ring/frodo_ring_en.html
<div id="outline-container-org977dd9a" class="outline-2">
<h2 id="org977dd9a">Gandalf and the horse</h2>
<div class="outline-text-2" id="text-org977dd9a">
<p>
The window, grimy thing it was, showed me movement, motion and the crackle of hooves on gravel announced a figure approaching.
</p>

<p>
A horse, white, one eyed, came trotting up the path like death&rsquo;s wedding carriage, all bone muscle coordination, it&rsquo;s hooves percussing against stone, clop thud clop, rhythm irregular, the beast favoring its left foreleg. One eye it had, the left socket empty, collapsed inward, a crater. The remaining eye rolled, massive as a boiled egg, surveying the world.
</p>

<p>
Gandalf sat astride it, his beard cascading, the waterfall of his hair gone feral and white as dishwater, his robes flapping.
</p>

<p>
&ldquo;Sam,&rdquo; I hissed, &ldquo;Gandalf&rsquo;s outside.&rdquo;
</p>

<p>
&ldquo;Gandalf?&rdquo; Sam&rsquo;s head whipped around, his tea sloshing. &ldquo;The wizard Gandalf? Here? Now?&rdquo;
</p>

<p>
We stumbled outside, the horse stopped. It breathed heavy, it&rsquo;s nostrils flaring, his breath steamed in the air, that shouldn&rsquo;t be cold but was anyway.
</p>

<p>
He dismounted, the horse snorted, that single eye rolling.
</p>

<p>
&ldquo;What seems to be the problem, Frodo?&rdquo; Gandalf approached.
</p>

<p>
&ldquo;My ring,&rdquo; I started. &ldquo;Bought it from Bilbo&rsquo;s Nephew&rsquo;s Shop, next to the elven hair combs section, you know the place? They sell invisibility rings, legitimate ones..&rdquo;
</p>

<p>
&ldquo;Legitimate,&rdquo; Gandalf snorted, the sound like a horse&rsquo;s snort, contemptuous, ancient.
</p>

<p>
&ldquo;..with warning labels! Professional warning labels! &lsquo;Use this ring only if you don&rsquo;t respect time, space.&rsquo;&rdquo;
</p>

<p>
&ldquo;And?&rdquo; Gandalf leaned on his staff, weight shifting, waiting.
</p>

<p>
&ldquo;And it&rsquo;s malfunctioning! Yesterday my legs walked separate from my torso. This morning? This morning, Gandalf, I blinked and my left arm vanished for six minutes. Six! Do you know how difficult it is to butter toast one armed when the missing arm is the dominant one?&rdquo;
</p>

<p>
Gandalf&rsquo;s beard twitched, might&rsquo;ve been smile, might&rsquo;ve been disgust. &ldquo;You phoned the manufacturer.&rdquo;
</p>

<p>
Not question. Statement. He knew.
</p>

<p>
&ldquo;Mordor Industries. Spoke with Sauron himself. He informed me..&rdquo; I spat the words, venom laced, fury soaked, &ldquo;..that I own the ring but license the invisibility. That the magic inside belongs to them. Forever. Perpetually. That they can deactivate it remotely if I violate terms of service I didn&rsquo;t read because who reads terms of service?&rdquo;
</p>

<p>
&ldquo;Everyone should,&rdquo; Gandalf muttered, &ldquo;but no one does. Tale old as time, that one.&rdquo;
</p>

<p>
Sam piped up, voice mouse squeaking, &ldquo;He&rsquo;s beside himself, Gandalf. Proper unraveled. Been drinking my mushroom tea and spiraling about ownership versus possession and..&rdquo;
</p>

<p>
&ldquo;How about you Gandalf?&rdquo; I asked, &ldquo;Why ride this cyclopean abomination instead of driving something sensible?&rdquo;
</p>

<p>
The horse snorted again, offended possibly, that single eye narrowing.
</p>

<p>
&ldquo;Update,&rdquo; Gandalf growled, word bitten off sharp. &ldquo;Software update. Automatic software update installed itself during the night while my vehicle sat charging. Midnight. No warning. No consent. Just ping, &lsquo;Update available, installing now, do not disconnect power, this will take fifteen minutes.&rsquo;&rdquo;
</p>

<p>
&ldquo;Fifteen minutes?&rdquo; Sam asked.
</p>

<p>
&ldquo;Seventeen hours,&rdquo; Gandalf roared, staff striking ground, sparks flying, actual sparks, little fires dying quick. &ldquo;Seventeen hours of &lsquo;Optimizing system performance, please wait.&rsquo; Morning came. Sun rose, birds sang their stupid songs. Car still optimizing. Still waiting. Checked the forums..&rdquo;
</p>

<p>
&ldquo;Forums?&rdquo; I blinked.
</p>

<p>
&ldquo;Wizard forums. Tech support for the magically inclined. Apparently this update, version 7.4.2, bricks vehicles manufactured before the Year of the Twisted Moon. Bricks them. Immobilizes them completely. Won&rsquo;t start. Won&rsquo;t charge. Just sits there, driveway decoration&rsquo;.&rdquo;
</p>

<p>
&ldquo;So you&rsquo;re riding..&rdquo; I gestured toward the horse.
</p>

<p>
&ldquo;Magnus,&rdquo; Gandalf said. &ldquo;His name is Magnus. One eyed white stallion. I needed transportation, he needed purpose.&rdquo;
</p>

<p>
Magnus stamped hoof, singular eye fixing on me, it&rsquo;s pupil dilating, contracting, unsettling in hypnotic rhythm.
</p>

<p>
&ldquo;How long until your car&rsquo;s fixed?&rdquo; Sam ventured.
</p>

<p>
&ldquo;Tech support says patch coming next week. Maybe. Possibly. &lsquo;Soon.&rsquo; You know how these things go. Meanwhile, I ride Magnus. We bond. He tolerates me. Now. About your ring. Let me see it.&rdquo;
</p>

<p>
I pulled the ring from pocket, held it out, metal catching light wrong, bending it, distorting it, reality rippling around the circumference.
</p>

<p>
Gandalf took it, held it close, eye squinting, other eye squinting differently, examining, probing, muttering words I didn&rsquo;t recognize, probably shouldn&rsquo;t recognize.
</p>

<p>
&ldquo;Mmm,&rdquo; he finally said. &ldquo;Yes. Definitely cheap. Definitely cursed. Definitely violating approximately seven hundred regulations regarding dimensional manipulation. You&rsquo;re lucky you haven&rsquo;t phased through the planet core yet.&rdquo;
</p>

<p>
&ldquo;Can you fix it?&rdquo;
</p>

<p>
He tossed the ring back. I caught it, fumbled, nearly dropped it.
</p>

<p>
&ldquo;No, Frodo. I cannot fix it. No one can fix it without the execution trace, because fixing costs only the replacement parts and selling you new model makes more money. Simple economics. Old as dragons hoarding gold. Older.&rdquo;
</p>

<p>
Magnus whinnied, agreement possibly, or hunger. Hard to tell with one eyed horses.
</p>

<p>
Sam muttered something about “not this again” and retreated into the cellar.
</p>
</div>
</div>
