frodo_ring/frodo_ring_en.html
<div id="outline-container-org394f471" class="outline-2">
<h2 id="org394f471">Riding to Mordor</h2>
<div class="outline-text-2" id="text-org394f471">
<p>
“Mordor,” Gandalf announced, his staff planted vertical like a flag claimed in conquered soil. The word hung there, fat and final. “We go to their headquarters. The glass tower, downtown district, thirty seventh floor.”
</p>

<p>
“You’re joking,” I said, but his beard had gone rigid, its bristles electric with purpose. Gandalf never jokes, not about corporations, not about towers that scrape the clouds and house departments named “Customer Service.”
</p>

<p>
“Confronting them face to face,” he growled, his staff planted, each syllable a stone dropped in still water. “Eyeball to eyeball. You want diagnostic data? You want execution traces? You want them to open their proprietary vault and spill secrets? Phone calls get you nowhere. Emails vanish into spam folders guarded by Nazguls. But presence, breathing their recycled air, standing in their lobby with its potted ferns dying slow deaths under fluorescent lights, that makes them uncomfortable.”
</p>

<p>
Magnus stamped, his hoof striking the earth his single eye, massive as a hard boiled egg left too long in brine, swiveled and fixed on me. The assessment was brutal. The calculation was merciless.
</p>

<p>
“Both of us?” I asked. My voice climbed octaves, became a mouse squeak, became a plea. “On&#x2026; that?”
</p>

<p>
“Magnus carries two,” Gandalf said, his voice flat as hammered iron. “He did it during the War of the Shattered Circle beneath a sky of falling ashes. He carried me and Saruman seventeen leagues while we dodged demons. He’ll manage one wizard, one half panicked hobbit. Get on.”
</p>

<p>
I approached. Magnus was a mountain, a cliff face white and vertical. Gandalf mounted first, his movement fluid like oil poured, like mercury sliding, practice having made it theater. He settled forward, his spine straight as accusation, and he offered his hand down to me. His arm extended, his sleeve flapping, the fabric a great, useless wing.
</p>

<p>
I grabbed and settled behind Gandalf, gripping his robes.
</p>

<p>
“Don’t fall off,” Gandalf advised, his tone conversational, as if he were discussing mild weather. “Magnus dislikes stopping.”
</p>

<p>
Magnus’s hooves moved. Clop thud clop. The rhythm established itself, a metronome cruel and steady. The path unfolded beneath us, the dirt becoming gravel, stones crunching like bones under the wheels of carts that had carried plague victims centuries ago.
</p>

<p>
The trees passed by, becoming blurs of green and brown, their branches clawing at the air we’d already vacated.
</p>

<p>
“Take the highway,” I shouted, my voice shredded by wind, by Magnus’s furnace hot breathing.
</p>

<p>
Gandalf turned his head partially; his beard whipped like flags in a storm. “Highway?”
</p>

<p>
“Yes. Highway. The asphalt ribbon, black and smooth, where modern vehicles conduct their petroleum powered pilgrimages. We’ll get there quicker. Faster. In six hours instead of twelve.”
</p>

<p>
He considered it, his hand rising to stroke his beard as the wind tangled it worse, creating knots that would require industrial solvents to unpick. “Magnus,” he addressed the horse, “can handle the highway traffic. Can’t you, Magnus?”
</p>

<p>
Magnus snorted, agreement perhaps, perhaps just clearing his nostrils of flies that had been investigating.
</p>

<p>
We turned. The path shifted beneath us, gravel transitioning to asphalt, the surface smooth, too smooth, an unnatural smoothness achieved through machines that heated the earth’s bones and spread them flat.
</p>

<p>
The on ramp rose before us, a concrete curve spiraling upward like a twisted DNA strand, ascending into the metal river that flowed fast and deadly. The traffic streamed, vehicles hurtling, metal comets with humans trapped inside their velocity.
</p>

<p>
Magnus hit the highway. His hooves struck the asphalt, the sound echoing clop clop clop amplified by a surface not meant for hooves but for vulcanized rubber.
</p>

<p>
Cars streamed past. A Ford to the left, a blue blur, whoooosh, its sound compressed and stretched. A horn blared, the sustained note of fury; the driver’s face was visible one instant, mouth wide, screaming, eyes bulging like fish dragged onto decks, then gone, swallowed by the distance.
</p>

<p>
An SUV to the right, a silver beast with a chrome grille grinning shark like, whoooosh. The driver gestured, raising a single finger, accusatory and anatomically improbable in its suggested trajectory.
</p>

<p>
A truck roared past, eighteen wheels of mechanical thunder. The gust slammed us sideways, a contained hurricane; Magnus compensated, his muscles flexing and adjusting, his hooves finding purchase on the treacherous asphalt. We survived. Barely. The truck’s horn, deep, basso profundo, the voice of an angry diesel god, blasted an obscene farewell.
</p>

<p>
Ahead, a structure emerged from heat shimmer and distance: a toll plaza. It&rsquo;s booths squatted across lanes like concrete toads, barriers mechanical with arms rising and falling, rising again in a hypnotic rhythm.
</p>

<p>
We approached it. Magnus slowed, his hooves gentler now, clop clop clop, almost polite, almost apologetic for existing in a space not designed for his kind.
</p>

<p>
A booth door opened. A woman emerged, her uniform crisp despite the heat, despite the improbability. Her face was confusion incarnate, disbelief given flesh, and a nametag that read &rsquo;Debra&rsquo; was pinned to her chest. Her eyebrows rose toward her hairline; her mouth opened, closed, opened again like a fish gasping on dock boards.
</p>

<p>
“You cannot drive this animal on the highway!”
</p>

<p>
Gandalf straightened.
</p>

<p>
“Drive?” His voice dropped, plummeted, an octave falling into the basement where light goes to die. He held the word, examined it, found it wanting, dripping with disdain, soaked in contempt, oceanic in scale.
</p>

<p>
He paused.
</p>

<p>
“Ride. We ride the horse.”
</p>

<p>
The grammar lesson was delivered. His tone was professorial, condescending; the verb was corrected; the action clarified; the linguistic crime was punished immediately.
</p>

<p>
Debra blinked, processing as if a syntax error were visible, her hands flailed now, gestures desperate, a drowning woman clutching at the absence of air.
</p>

<p>
“Horses aren’t allowed! No animals! No livestock!”
</p>

<p>
“We&rsquo;ll take the next exit and go through the forest,” Gandalf announced.
</p>

<p>
Magnus hooves resumed, clop clop clop, with Debra shouting behind us, her words dissolving into wind.
</p>
</div>
</div>
