frodo_ring/frodo_ring_en.html
<div id="outline-container-org1cd7f5a" class="outline-2">
<h2 id="org1cd7f5a">Recharging station</h2>
<div class="outline-text-2" id="text-org1cd7f5a">
<p>
The off-ramp curved, spiraled downwards, Magnus descended carefully, his hooves picking a path through cracks where ambitious weeds pushed through, reclaiming territory one root at a time. We reached to the bottom, we reached street level, we reached a situation that was bizarre.
</p>

<p>
Cars were everywhere, dozens, scores, maybe hundreds obscured in the distance. Dead they sat, automotive corpses, their doors hung open like fish mouths gasping final breaths, their hoods exposed their failing metal hearts. Drivers stood, congregating; a cluster of confusion with panic percolating through.
</p>

<p>
We slowed to a walk, Magnus&rsquo;s hooves, clip, clop, clip, polite percussion, respectful of the dead machinery surrounding. The beast knew death when he smelled it, even death silicon based, battery powered.
</p>

<p>
A recharging station loomed center stage with a skeletal metal frame, solar panels spread overhead wing like, useless now as tits on a bull. Beneath it, charging stalls stood empty, cables dangling limp as dead snakes, their connectors mouths open, hungry, unpowered.
</p>

<p>
A man in glasses, wire rimmed, pristine, stood near the entrance kiosk, hands gesturing sharp at the gathering crowd. His polo shirt bore an embroidered logo: &ldquo;GreenCharge Station.&rdquo;
</p>

<p>
&ldquo;Look, I don&rsquo;t know what happened! The system just, it went dark. All of it. The Powerwalls, the solar feed, the backup grid connection, everything. I&rsquo;ve got corporate on hold for forty minutes and they keep playing that goddamn smooth jazz. Just click. Gone. My whole Powerwall garage system, dead. Seventy three percent charge I had. Had. Dashboard lit up, &lsquo;Power System Failure&rsquo;, then nothing. Dead. Deader than my marriage, deader than my hope of retiring before seventy.&rdquo;
</p>

<p>
A woman beside him, wearing yoga pants, sunglasses expensive perched atop her head, &ldquo;I am..&rdquo; she gestured violent, hands chopping air, &ldquo;..two miles from home. Two miles. Now I&rsquo;m here, stranded at this godforsaken charging station that won&rsquo;t charge, watching my groceries spoil in the trunk. Ice cream&rsquo;s melted. Chicken&rsquo;s warming. I&rsquo;ve got a Zoom call in forty minutes and my laptop&rsquo;s in the car and the car won&rsquo;t..&rdquo;
</p>

<p>
Voice cut off. Hands covered her face.
</p>

<p>
&ldquo;Should&rsquo;ve read the terms,&rdquo; another voice said. A younger man, tablet tucked under his arm, stepped forward. &ldquo;Section seven, subsection D, paragraph twelve. &lsquo;Company reserves right to disable, modify, or terminate functionality of any connected device, at any time, for any reason company deems necessary, including but not limited to safety concerns, regulatory compliance, or strategic business decisions. User agrees to waive all claims.&rsquo; You all clicked &lsquo;I Agree.&rsquo; You agreed.&rdquo;
</p>

<p>
&ldquo;Oh, shut up, nobody reads those,&rdquo; the yoga pants woman said. Simple. Final.
</p>

<p>
An older man leaned against a truck bed, coveralls wearing grease ancient, hands tattooed permanent with motor oil. His face leather worn, sun beaten, eyes squinted to slits calculating. &ldquo;Powerwalls,&rdquo; he said, voice gravel rough, each word a stone dropped. &ldquo;The solar recharging stations, all of them, run on Powerwall batteries, model HX Nine. The company that made them, installed them, and promised &lsquo;revolutionize energy independence&rsquo; and &lsquo;power freedom.&rsquo; Freedom.&rdquo; He spat. The brown glob hit the asphalt, it sizzled quiet. &ldquo;This morning, zero dark thirty, company flipped the switch. Kill switch. The batteries had faulty chemistry, their lithium cells degrading faster than projected, their thermal runaway imminent. Remotely deactivated every single Powerwall unit, simultaneously.&rdquo;
</p>

<p>
One man kicked his car&rsquo;s tire. Hard. His foot rebounded, pain obvious from the way he hopped, cursing string of pearls style, each word a gem polished by fury.
</p>

<p>
A man slumped against a car, phone dangling from his hand, voice robot recorded emanating: &ldquo;Your estimated wait time is, thirty seven minutes. Please continue holding. Your call is important..&rdquo;
</p>

<p>
&ldquo;Important?&rdquo; he screamed at the phone. &ldquo;Then answer, you algorithmic bastards.&rdquo;
</p>

<p>
We rode past. Magnus&rsquo;s hooves found rhythm again. Clop thud clop. Steady. Certain. Carrying us forward away.
</p>

<p>
Behind us, more voices rose, layered cacophony style: complaints, threats, prayers maybe. Someone sobbed. Someone else laughed, a child asked, &ldquo;Daddy, when are we going home?&rdquo; and received no answer.
</p>
</div>
</div>
